{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Skill",
    "2": "I-Skill",
    "3": "B-Tool",
    "4": "I-Tool",
    "5": "B-Certification",
    "6": "I-Certification",
    "7": "B-Education",
    "8": "I-Education",
    "9": "B-Language",
    "10": "I-Language",
    "11": "B-Seniority",
    "12": "I-Seniority"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Certification": 5,
    "B-Education": 7,
    "B-Language": 9,
    "B-Seniority": 11,
    "B-Skill": 1,
    "B-Tool": 3,
    "I-Certification": 6,
    "I-Education": 8,
    "I-Language": 10,
    "I-Seniority": 12,
    "I-Skill": 2,
    "I-Tool": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
